local alpha = require('alpha')
local dashboard = require('alpha.themes.dashboard')

-- Set custom header
dashboard.section.header.val = {
  "                                                     ",
  "  ███╗   ██╗███████╗ ██████╗ ██╗   ██╗██╗███╗   ███╗ ",
  "  ████╗  ██║██╔════╝██╔═══██╗██║   ██║██║████╗ ████║ ",
  "  ██╔██╗ ██║█████╗  ██║   ██║██║   ██║██║██╔████╔██║ ",
  "  ██║╚██╗██║██╔══╝  ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║ ",
  "  ██║ ╚████║███████╗╚██████╔╝ ╚████╔╝ ██║██║ ╚═╝ ██║ ",
  "  ╚═╝  ╚═══╝╚══════╝ ╚═════╝   ╚═══╝  ╚═╝╚═╝     ╚═╝ ",
  "                                                     "
}

dashboard.section.buttons.val = {
  dashboard.button( "e", "  > File Tree"      , ":NvimTreeOpen<CR>"),
  dashboard.button( "f", "  > Find file"      , ":Telescope find_files<CR>"),
  dashboard.button( "k", "  > Keymaps"        , ":WhichKey<CR>"),
  dashboard.button( "s", "  > Settings"       , ":e $MYVIMRC | :cd %:p:h | split . | wincmd k | pwd<CR>"),
  dashboard.button( "q", "  > Quit NVIM"      , ":qa<CR>"),
}

-- Apply the configuration
alpha.setup(dashboard.config)
